from SQL.user_models import Database_user


class AboutUsMessages:
    def __init__(self):
        self.about_us_statuses = "🥇 Даритель – стартовая позиция на доске.\n" \
                                 "Даритель связывается с Получателем, уточняет реквизиты и дарит подарок.\n" \
                                 "🔸 Даритель может приглашать новых участников после подтверждения " \
                                 "отправленного подарка.\n\n🥈 Строитель – вторая позиция на доске на пути " \
                                 "к Получателю.\n🔸 Строитель строит команду, подключает новых Дарителей.\n\n" \
                                 "🏅 Получатель - финальная позиция на доске.\n" \
                                 "🔸 Теперь Дарители связываются с вами и отправляют вам подарок."

        self.about_us = "🎁 “Мир Подарков” - сообщество людей, в котором люди дарят друг другу безвозмездные " \
                        "подарки.\n\n" \
                        "🤝 Между участниками нет посредников, в системе нет комиссий, нет никакого ввода и вывода, " \
                        "нет накопления средств.\n\n" \
                        "🟢 Зарегистрируйся на любое количество  досок, свяжись с человеком в центре доски " \
                        "(Получателем), уточни реквизиты и подари  подарок.\n\n" \
                        "🤝 Затем поделись информацией об этом боте с друзьями.\n\n" \
                        "✅ Таким образом ты запустишь невероятную волну подарков, которые могут поступать тебе " \
                        "снова и снова, снова и снова.\n\n" \
                        "🔟 Чем больше участников у тебя на первой линии тем выше скорость прохождения всех досок."

    @staticmethod
    def about_us_boards(user_id) -> str:
        base = Database_user()
        language = base.get_user_data(user_id, ["country"])[0]
        currency = {
            "RU": "РУБ|RUB", "UZ": "Сум", "BY": "РУБ|BYN", "KG": "Сом", "KZ": "Тенге", "TJ": "Сомони", "TM": "Манат",
            "TR": "Лира", "UA": "Гривна"
        }
        gift_size = {
            "RU": ("100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000", "100,000",
                   "200,000", "400,000", "800,000", "1,600,000", "3,200,000"),
            "UZ": ("10,000", "20,000", "40,000", "80,000", "160,000", "320,000", "640,000", "1,200,000", "2,400,000",
                   "4,800,000", "10,000,000", "20,000,000", "40,000,000", "80,000,000", "160,000,000", "320,000,000"),
            "BY": ("5", "10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000",
                   "40,000", "80,000", "160,000"),
            "KG": ("100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000", "100,000",
                   "200,000", "400,000", "800,000", "1,600,000", "3,200,000"),
            "KZ": ("500", "1,000", "2,000", "4,000", "8,000", "16,000", "32,000", "64,000", "120,000", "240,000",
                   "480,000", "1,000,000", "2,000,000", "4,000,000", "8,000,000", "16,000,000"),
            "TJ": ("10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800",
                   "10,000", "20,000", "40,000", "80,000", "160,000", "320,000"),
            "TM": ("5", "10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000",
                   "40,000", "80,000", "160,000"),
            "TR": ("20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000", "40,000",
                   "80,000", "160,000", "320,000", "640,000"),
            "UA": ("50", "100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000",
                   "100,000", "200,000", "400,000", "800,000", "1,600,000")
        }
        recieve_amount = {
            "RU": ("400", "800", "1,600", "3,200", "6,400", "12,800", "25,600", "48,000", "96,000", "192,000",
                   "400,000", "800,000", "1,600,000", "3,200,000", "6,400,000", "12,800,000"),
            "UZ": ("40,000", "80,000", "160,000", "320,000", "640,000", "1,280,000", "2,560,000", "4,800,000",
                   "9,600,000", "19,200,000", "40,000,000", "80,000,000", "160,000,000", "320,000,000",
                   "640,000,000", "1,280,000,000"),
            "BY": ("20", "40", "80", "160", "320", "640", "1,280", "2,560", "4,800", "9,600", "19,200", "40,000",
                   "80,000", "160,000", "320,000", "640,000"),
            "KG": ("400", "800", "1,600", "3,200", "6,400", "12,800", "25,600", "48,000", "96,000", "192,000",
                   "400,000", "800,000", "1,600,000", "3,200,000", "6,400,000", "12,800,000"),
            "KZ": ("2,000", "4,000", "8,000", "16,000", "32,000", "64,000", "128,000", "256,000",
                   "480,000", "960,000", "1,920,000", "4,000,000", "8,000,000", "16,000,000",
                   "32,000,000", "64,000,000"),
            "TJ": ("40", "80", "160", "320", "640", "1,280", "2,560", "4,800",
                   "9,600", "19,200", "40,000", "80,000", "160,000", "320,000",
                   "640,000", "1,280,000"),
            "TM": ("20", "40", "80", "160", "320", "640", "1,280", "2,560", "4,800", "9,600", "19,200", "40,000",
                   "80,000", "160,000", "320,000", "640,000"),
            "TR": ("80", "160", "320", "640", "1,280", "2,560", "4,800", "9,600", "19,200", "40,000", "80,000",
                   "160,000", "320,000", "640,000", "1,280,000", "2,560,000"),
            "UA": ("200", "400", "800", "1,600", "3,200", "6,400", "12,800", "25,600", "48,000", "96,000",
                   "192,000", "400,000", "800,000", "1,600,000", "3,200,000", "6,400,000")
        }
        total_summ = {
            "RU": "25,586,800", "UZ": "2,558,680,000", "BY": "1,278,700", "KG": "25,586,800", "KZ": "127,870,000",
            "TJ": "2,558,680", "TM": "1,278,700", "TR": "5,116,640", "UA": "12,787,000"
        }
        return "📋 В боте «Мир Подарков» создано 16 досок с разным номиналом подарков:\n\n" \
               f"🔴Начальная-I ({gift_size[language][0]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][0]} {currency[language]}\n\n" \
               f"⭕️Начальная-II ({gift_size[language][1]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][1]} {currency[language]}\n\n" \
               f"♦️Начальная-III ({gift_size[language][2]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][2]} {currency[language]}\n\n" \
               f"🟤Средняя ({gift_size[language][3]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][3]} {currency[language]}\n\n" \
               f"🌑Железная ({gift_size[language][4]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][4]} {currency[language]}\n\n" \
               f"🟠Бронзовая ({gift_size[language][5]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][5]} {currency[language]}\n\n" \
               f"⚪️Серебро ({gift_size[language][6]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][6]} {currency[language]}\n\n" \
               f"🟢Нефритовая ({gift_size[language][7]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][7]} {currency[language]}\n\n" \
               f"🌀Хрустальная ({gift_size[language][8]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][8]} {currency[language]}\n\n" \
               f"🟡Золотая ({gift_size[language][9]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][9]} {currency[language]}\n\n" \
               f"⚫️Платина ({gift_size[language][10]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][10]} {currency[language]}\n\n" \
               f"🔵Адамантовый ({gift_size[language][11]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][11]} {currency[language]}\n\n" \
               f"🫧Жемчужная ({gift_size[language][12]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][12]} {currency[language]}\n\n" \
               f"💎Алмазная ({gift_size[language][13]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][13]} {currency[language]}\n\n" \
               f"🍸Кристальная ({gift_size[language][14]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][14]} {currency[language]}\n\n" \
               f"⭐️Элитная ({gift_size[language][15]} {currency[language]})\nПолучаете подарками " \
               f"{recieve_amount[language][15]} {currency[language]}\n\n" \
               f"🎁 В итоге, подарив один раз {gift_size[language][0]} {currency[language]} и пригласив " \
               f"одного и более друзей, пройдя каждую доску по одному разу, вы можете получить подарками " \
               f"{total_summ[language]} {currency[language]}."
