from SQL.user_models import Database_user


class SentGiftMessages:
    def __init__(self):
        self.activated = "🎉 Поздравляем! Теперь вам доступна ваша собственная ссылка для привлечения участников!\n\n" \
                         "🔍 Ваша ссылка находится в разделе '👥 Приглашение'"
        self.confirm_sent_gift = "Уведомление о подарке отправлено получателю. Ждем подтверждения!"
        self.approve_sent = "❓ Уверены"

    @staticmethod
    def close_board(board_id):
        return f"🎉 Поздравляем! Вы получили все подарки на доске ID {board_id}! Пора идти на следующую доску!"

    @staticmethod
    def ask_about_gift(user_id: int, board_index: str) -> str:
        base = Database_user()
        username, user_full_name, user_phone, language = \
            base.get_user_data(user_id, ["username", "user_full_name", "user_phone", "country"])
        summ_dict = {
            "RU": ("100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000", "100,000",
                   "200,000", "400,000", "800,000", "1,600,000", "3,200,000"),
            "UZ": ("10,000", "20,000", "40,000", "80,000", "160,000", "320,000", "640,000", "1,200,000", "2,400,000",
                   "4,800,000", "10,000,000", "20,000,000", "40,000,000", "80,000,000", "160,000,000", "320,000,000"),
            "BY": ("5", "10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000",
                   "40,000", "80,000", "160,000"),
            "KG": ("100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000", "100,000",
                   "200,000", "400,000", "800,000", "1,600,000", "3,200,000"),
            "KZ": ("500", "1,000", "2,000", "4,000", "8,000", "16,000", "32,000", "64,000", "120,000", "240,000",
                   "480,000", "1,000,000", "2,000,000", "4,000,000", "8,000,000", "16,000,000"),
            "TJ": ("10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800",
                   "10,000", "20,000", "40,000", "80,000", "160,000", "320,000"),
            "TM": ("5", "10", "20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000",
                   "40,000", "80,000", "160,000"),
            "TR": ("20", "40", "80", "160", "320", "640", "1,200", "2,400", "4,800", "10,000", "20,000", "40,000",
                   "80,000", "160,000", "320,000", "640,000"),
            "UA": ("50", "100", "200", "400", "800", "1,600", "3,200", "6,400", "12,000", "24,000", "48,000",
                   "100,000", "200,000", "400,000", "800,000", "1,600,000")
        }
        currency = {
            "RU": "РУБ|RUB", "UZ": "Сум", "BY": "РУБ|BYN", "KG": "Сом", "KZ": "Тенге", "TJ": "Сомони", "TM": "Манат",
            "TR": "Лира", "UA": "Гривна"
        }
        return f"Пользователь отправил вам подарок {summ_dict[language][int(board_index)]} {currency[language]}!\n\n" \
               f"🔑 Логин: @{username}\n" \
               f"🙂 Имя: {user_full_name}\n" \
               f"☎️ Телефон: {user_phone}\n\n" \
               f"Подтвердите получение:"

    @staticmethod
    def gift_received(oper_data: tuple) -> str:
        base = Database_user()
        language = base.get_user_data(oper_data[3], ["country"])[0]
        currency = {
            "RU": "РУБ|RUB", "UZ": "Сум", "BY": "РУБ|BYN", "KG": "Сом", "KZ": "Тенге", "TJ": "Сомони", "TM": "Манат",
            "TR": "Лира", "UA": "Гривна"
        }
        king_username = base.get_user_data(oper_data[4], ["username"])
        return f"Получатель подтвердил получение вашего подарка!\n\n" \
               f"🔑 Логин получателя: @{king_username[0]}\n" \
               f"🎁 Стоимость подарка: {oper_data[5]} {currency[language]}"

    @staticmethod
    def gift_escape(oper_data: tuple) -> str:
        base = Database_user()
        king_username = base.get_user_data(oper_data[4], ["username"])
        language = base.get_user_data(oper_data[3], ["country"])[0]
        currency = {
            "RU": "РУБ|RUB", "UZ": "Сум", "BY": "РУБ|BYN", "KG": "Сом", "KZ": "Тенге", "TJ": "Сомони", "TM": "Манат",
            "TR": "Лира", "UA": "Гривна"
        }
        return f"Получатель не подтвердил получение вашего подарка!\n\n" \
               f"🔑 Логин получателя: @{king_username[0]}\n" \
               f"🎁 Стоимость подарка: {oper_data[5]} {currency[language]}"

    # @staticmethod
    # def kvalification(sender_id: int, board_index: int) -> str:
    #     base = Database_user()
    #     sender_username = base.get_user_data(sender_id, ["username"])[0]
    #     boards = ("🔴Начальная-I", "⭕️Начальная-II", "♦️Начальная-III", "🟤Средняя", "🌑Железная", "🟠Бронзовая",
    #               "⚪️Серебро", "🟢Нефритовая", "🌀Хрустальная", "🟡Золотая", "⚫️Платина", "🔵Адамантовая",
    #               "🫧Жемчужная", "💎Алмазная", "🍸Кристальная", "⭐️Элитная")
    #     return f"🎉 Поздравляем! Приглашенный вами участник @{sender_username} отправил подарок на доске " \
    #            f"{boards[board_index]}!\n\nВы прошли квалификацию, и теперь вам доступна доска нового уровня: " \
    #            f"{boards[board_index+1]}!" if board_index<15 else f"🎉 Поздравляем! Приглашенный вами участник " \
    #                                                               f"@{sender_username} отправил подарок на доске " \
    #                                                               f"{boards[board_index]}!"

    @staticmethod
    def kvalification(sender_id: int, board_index: int) -> str:
        base = Database_user()
        sender_username = base.get_user_data(sender_id, ["username"])[0]
        boards = ("🔴Начальная-I", "⭕️Начальная-II", "♦️Начальная-III", "🟤Средняя", "🌑Железная", "🟠Бронзовая",
                  "⚪️Серебро", "🟢Нефритовая", "🌀Хрустальная", "🟡Золотая", "⚫️Платина", "🔵Адамантовая",
                  "🫧Жемчужная", "💎Алмазная", "🍸Кристальная", "⭐️Элитная")
        return f"🎉 Поздравляем! Приглашенный вами участник @{sender_username} отправил подарок на доске " \
               f"{boards[board_index]}!"


    @staticmethod
    def new_board_builder_notification(board_index: int, new_board: str) -> str:
        boards = ("🔴Начальная-I", "⭕️Начальная-II", "♦️Начальная-III", "🟤Средняя", "🌑Железная", "🟠Бронзовая",
                  "⚪️Серебро", "🟢Нефритовая", "🌀Хрустальная", "🟡Золотая", "⚫️Платина", "🔵Адамантовая",
                  "🫧Жемчужная", "💎Алмазная", "🍸Кристальная", "⭐️Элитная")
        return f"🎉 Поздравляем! Теперь вы Строитель!\n\n" \
               f"❇️ Доска: {boards[board_index]}\n" \
               f"⚜️ ID доски: {new_board}\n\n" \
               f"Приглашайте Дарителей, чтобы стать Получателем!"

    @staticmethod
    def new_board_king_notification(board_index: int, new_board: str) -> str:
        boards = ("🔴Начальная-I", "⭕️Начальная-II", "♦️Начальная-III", "🟤Средняя", "🌑Железная", "🟠Бронзовая",
                  "⚪️Серебро", "🟢Нефритовая", "🌀Хрустальная", "🟡Золотая", "⚫️Платина", "🔵Адамантовая",
                  "🫧Жемчужная", "💎Алмазная", "🍸Кристальная", "⭐️Элитная")
        return f"🎉 Поздравляем! Теперь вы Получатель!\n\n" \
               f"❇️ Доска: {boards[board_index]}\n" \
               f"⚜️ ID доски: {new_board}\n\n"

    @staticmethod
    def channel_message(board_index: str, amount: int, language: str) -> str:
        boards = ("🔴Начальная-I", "⭕️Начальная-II", "♦️Начальная-III", "🟤Средняя", "🌑Железная", "🟠Бронзовая",
                  "⚪️Серебро", "🟢Нефритовая", "🌀Хрустальная", "🟡Золотая", "⚫️Платина", "🔵Адамантовая",
                  "🫧Жемчужная", "💎Алмазная", "🍸Кристальная", "⭐️Элитная")
        currency = {
            "RU": "РУБ|RUB", "UZ": "Сум", "BY": "РУБ|BYN", "KG": "Сом", "KZ": "Тенге", "TJ": "Сомони", "TM": "Манат",
            "TR": "Лира", "UA": "Гривна"
        }
        return f"🎁 А сейчас кто-то получил подарок в размере {amount} {currency[language]}\n\n" \
               f"🔰 Доска: {boards[int(board_index)]}\n\n" \
               f"🥰 Поздравляем и желаем быть счастливым!"
