class Start_Messages:
    def __init__(self):
        self.no_username = "Укажи имя пользователя Telegram, это нужно для того, чтобы твой Даритель мог связаться " \
                           'с тобой!\n\n<a href="https://silverweb.by/kak-sozdat-nik-v-telegramm/">Инструкция</a>'
        self.bad_deep_link = "❌ Неверная реферальная ссылка, возьми свою ссылку у наставника!\n\n" \
                             "❌ Geçersiz yönlendirme bağlantısı, bağlantınızı bir akıl hocasından alın!"
        self.rules = "🎁 'Мир Подарков' - сообщество людей, в котором люди дарят друг другу денежные подарки.\n" \
                     "❇️ Децентрализованная система дарения, в которой подарки движутся от человека к человеку без" \
                     "комиссий и посредников.\n\n" \
                     "🗒 Регистрация в Бот возможна только приняв Правила.\n\n" \
                     '<a href="https://telegra.ph/Pravila-02-09-32">Правила</a>\n\n' \
                     "🤝 Ознакомьтесь и нажмите на кнопку 'Я принимаю условия'"
        self.ask_country = "🌍 Выбери свою страну\n\n🌍 Ülkenizi seçin"
        self.ask_contact = "❗ КНОПКА ПОД СТРОКОЙ СООБЩЕНИЙ!!! 👇\n\n" \
                           "❇️ Для того чтобы получить доступ к доскам, нажмите 'ОТПРАВИТЬ НОМЕР ТЕЛЕФОНА'\n\n" \
                           "📲 Ваш контакт будет виден только вашему наставнику и Дарителям, которые будут с вами" \
                           "связываться, чтобы отправить вам подарок\n\n" \
                           "‼️ Нажмите на 'ОТПРАВИТЬ НОМЕР ТЕЛЕФОНА'\n\n" \
                           "🔰 Обещаем, что от сообщества не будет поступать спам рассылка или другие сообщения\n\n" \
                           "❗ КНОПКА ПОД СТРОКОЙ СООБЩЕНИЙ!!! 👇\n\n" \
                           "❗ Если не видно кнопки, нажмите на квадратик с четырьмя точками, справа от строки" \
                           "написания сообщений"
        self.no_deep_link = "✅ Перейди в бота по реферальной ссылке от приглашающего!\n\n" \
                            "✅ Davet eden kişiden gelen yönlendirme bağlantısını kullanarak bota gidin!"
        self.start_message_ask_subscribe = "👋 Пришло время познакомиться с сообществом.\n\n" \
                                           "❗ Прежде чем продолжить, вам нужно подписаться на официальные ресурсы:\n\n" \
                                           "- Группа 'Мир Подарков'\n-Группа 'Мир подарков отзывы'\n-Канал " \
                                           "отчета о подарках 'Мира Подарков'\n-YouTube канал\n-Instagram"
        self.retry_subscribe = "❌ Ты не вступил в телеграм группу! Попробуй еще раз и нажми на кнопку 'Я " \
                               "подписался'!!!"
